SET NAMES 'utf8';
DROP DATABASE IF EXISTS tea;
CREATE DATABASE tea CHARSET=UTF8;
USE tea;

CREATE TABLE tea_dish(
    did INT PRIMARY KEY AUTO_INCREMENT,
    name VARCHAR(64),
    price FLOAT(6,2),
    img_sm VARCHAR(64),
    img_lg VARCHAR(64),
    detail VARCHAR(2048),
    intro VARCHAR(2048)
);
INSERT INTO tea_dish(did,img_sm,img_lg,name,price,intro,detail) VALUES
(   null,
    '01-lj.jpg',
    '01-lj-1.jpg',
    '【龙井】',
    109,
    '爱上龙井 只因那一杯茶的故事',
    '龙井是中华传统名茶，属于绿茶，位列中国茶品之首。龙井茶产于浙江杭州西湖一带，由古代茶农创制于宋代，已有一千二百余年历史。龙井茶色泽翠绿，香气浓郁，甘醇爽口，形如雀舌，即有“色绿、香郁、味甘、形美”四绝的特点，西湖龙井茶叶为扁形，叶细嫩，条形整齐，宽度一致，为绿黄色，手感光滑，一芽一叶或二叶。西湖龙井茶清香馥郁，滋味更加鲜醇爽口。龙井茶含氨基酸、儿茶素、叶绿素、维生素C等成分均比其它茶叶多，营养丰富。与红茶，白茶齐名，为中国最主要茶类之一………… '
),
(   null,
    '02-blc.jpg',
    '02-blc-1.jpg',
    '【碧螺春】',
    68,
    '鲜雅、味醇、回甘三种妙韵，行家品鉴之选',
    '碧螺春是中国传统名茶，中国十大名茶之一，属于绿茶类，已有1000多年历史。碧螺春产于江苏省苏州市吴县太湖的东洞庭山及西洞庭山（今苏州吴中区）一带，所以又称“洞庭碧螺春”。唐朝时就被列为贡品，古人们又称碧螺春为“功夫茶”、“新血茶”。高级的碧螺春，茶芽之细嫩0.5公斤干茶需要茶芽6-7万个。炒成后的干茶条索紧结，白毫显露，色泽银绿，翠碧诱人，卷曲成螺，产于春季，故名“碧螺春”。此茶冲泡后杯中白云翻滚，清香袭入，是中国的名茶。主要工序为杀青、揉捻、搓团显毫、烘干。'
),
(   null,
    '03-hsmf.jpg',
    '03-hsmf-1.jpg',
    '【黄山毛峰】',
    133,
    '黄金鱼叶 肥嫩成朵 独饮一杯茶 平心静气',
    '黄山毛峰是中国十大名茶之一，属于绿茶。产于安徽省黄山（徽州）一带，所以又称徽茶。由清代光绪年间谢裕大茶庄所创制。每年清明谷雨，选摘良种茶树“黄山种”、“黄山大叶种”等的初展肥壮嫩芽，手工炒制，该茶外形微卷，状似雀舌，绿中泛黄，银毫显露，且带有金黄色鱼叶（俗称黄金片）。入杯冲泡雾气结顶，汤色清碧微黄，叶底黄绿有活力，滋味醇甘，香气如兰，韵味深长。由于新制茶叶白毫披身，芽尖峰芒，且鲜叶采自黄山高峰，遂将该茶取名为黄山毛峰。'
),
(   null,
    '04-lagp.jpg',
    '04-lagp-1.jpg',
    '【六安瓜片】',
    124,
    '采摘无芽无梗嫩叶制作 入口微苦回味甘甜持久',
    '六安瓜片，中华传统历史名茶，中国十大名茶之一，简称瓜片、片茶，产自安徽省六安市大别山一带，唐称“庐州六安茶”，为名茶；明始称“六安瓜片”，为上品、极品茶；清为朝廷贡茶。六安瓜片，为绿茶特种茶类。“具有悠久的历史底蕴和丰厚的文化内涵。在世界所有茶叶中，六安瓜片是唯一无芽无梗的茶叶，由单片生叶制成。去芽不仅保持单片形体，且无青草味；梗在制作过程中已木质化，剔除后，可确保茶味浓而不苦，香而不涩。六安瓜片每逢谷雨前后十天之内采摘，采摘时取二、三叶，求“壮”不求“嫩”。'
),
(   null,
    '05-tphk.jpg',
    '05-tphk-1.jpg',
    '【太平猴魁】',
    159,
    '内置醇香之物而浑然不自觉，手工制作，品质更优。',
    '太平猴魁，中国传统名茶，中国历史名茶之一，属于绿茶类尖茶，产于安徽太平县（现改为黄山市黄山区）一带，为尖茶之极品，久享盛名。其外形两叶抱芽，扁平挺直，自然舒展，白毫隐伏，有“猴魁两头尖，不散不翘不卷边”的美名。茶叶中所含的化学成分达500多种，具有抗菌、抑菌作用、减肥作用、防龋齿、抑制癌细胞等功效。清咸丰(1859)，猴魁先祖郑守庆就在麻川河畔的山中开出一块茶园，生产出扁平挺直、鲜爽味醇且散发出阵阵兰花香味的“尖茶”，冠名“太平尖茶”。现在，猴魁茶界普遍认为“太平尖茶”是太平猴魁的前身。2004年，在国际茶博会上获得“绿茶茶王”称号。'
),
(   null,
    '06-ajbc.jpg',
    '06-ajbc-1.jpg',
    '【安吉白茶】',
    239,
    '花香型，如兰似玉，可观赏的甄选自饮茶',
    '安吉白茶（白叶茶）是一种珍罕的变异茶种，属于“低温敏感型”茶叶，其阈值约在23℃。茶树产“白茶”时间很短，通常仅一个月左右。以原产地浙江安吉为例，春季，因叶绿素缺失，在清明前萌发的嫩芽为白色。在谷雨前，色渐淡，多数呈玉白色。雨后至夏至前，逐渐转为白绿相间的花叶。至夏，芽叶恢复为全绿，与一般绿茶无异。正因为神奇的安吉白茶是在特定的白化期内采摘、加工和制作的，所以茶叶经瀹泡后，其叶底也呈现玉白色，这是安吉白茶特有的性状。'
),
(   null,
    '07-yhbh.jpg',
    '07-yhbh-1.jpg',
    '【银海白毫】',
    68,
    '高性价比 足滋足味更耐泡',
    '白毫是茶叶嫩芽背面生长的一层细绒毛，干燥后呈现白色，如果保持其不脱落，茶叶显现白色，为白茶，浸泡后，白毫仍然附着在茶叶上。绿茶经过揉捻，白毫脱落干碎，沏茶后，碎落的白毫漂浮在水面，形成似乎像油膜一样，证明茶叶非常新鲜，如果保存时间长或经过长途运输，白毫散失，不会再有这种现象。其他种茶叶由于经过深加工，不会有白毫存在。'
),
(   null,
    '08-tsmf.jpg',
    '08-tsmf-1.jpg',
    '【塔山毛峰】',
    198,
    '烘靑工艺 香气更浓 实惠自饮装',
    '产于四川荥经塔子山，该地平均海拔高1350米，群山环抱，终年少日照，多雨雾，雨量充沛，土壤肥沃，适宜茶树生长。塔山毛峰外形为针形紧细有锋苗，色泽绿润显毫，栗香持久，滋味浓厚鲜爽，汤色黄绿明亮，叶底黄绿嫩匀。 因为是老川茶，树龄较长，制作工艺比较传统，所以制作出来的茶叶比较紧实，先撮4-5克茶叶置入透明玻璃杯中，头泡时最好先倒少量鲜开水发一下，等闻到茶香四溢时倒掉头泡水，再冲入大半杯水，就可看见茶叶在杯中飞舞着慢慢舒展开来，实为眼鼻之一大享受也。老川茶耐泡，回口香甜，四五泡之后仍有余香。'
);

##SELECT * FROM tea_dish;

CREATE TABLE tea_order(
    oid INT PRIMARY KEY AUTO_INCREMENT,
    phone VARCHAR(16),
    user_name VARCHAR(16),
    sex INT,    /*1:男  2:女*/
    order_time LONG,
    addr VARCHAR(256),
    did INT
);
INSERT INTO tea_order(oid, phone,user_name,sex,order_time,addr,did) VALUES
(NULL,'13501234567','婷婷',2,1445154859209,'中大街1号',3),
(NULL,'13501234567','婷婷',2,1445254959209,'中大街1号',2),
(NULL,'13501234567','婷婷',2,1445354959209,'中大街1号',5);

##SELECT * FROM tea_order;